Tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
 
    <!-- Configuration du client -->
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="30000"/>
    </clients>
 
    <!-- Configuration du serveur -->
    <servers>
        <server host="TARGETHOST" port="TARGETPORT" type="tcp"></server>
    </servers>
 
    <!-- phases d'arrivée, 3 paliers de 10 minutes où l'on augmente la fréquence d'arrivée de 1 puis 10 puis 30 visiteurs par seconde -->
    <load>
        <arrivalphase phase="1" duration="10" unit="minute">
            <users arrivalrate="10000" unit="second"></users>
        </arrivalphase>
        <arrivalphase phase="2" duration="10" unit="minute">
            <users arrivalrate="20000" unit="second"></users>
        </arrivalphase>
        <arrivalphase phase="3" duration="10" unit="minute">
            <users arrivalrate="30000" unit="second"></users>
        </arrivalphase>
    </load>
 
    <!-- Les scénarios -->
    <sessions>
        <!-- Scénarios 1 avec 100% de probabilité, l'internaute charge successivement 3 pages -->
        <session name="scenario1" probability="100" type="ts_http">
            <request><http url='/test2.bin' version='1.1' method='GET'></http></request>
        </session>
    </sessions>
</tsung>